In [1]:
import pandas as pd
import numpy as np

In [2]:
cars_dictionary = {
    "model" :[ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"],
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}
df = pd.DataFrame(cars_dictionary)
df

           model   Color   HP  Weight (KG)  price
0         Peykan     Red   48          990     33
1         BMW X6   White  335         2320   2400
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

In [3]:
df.columns

Index(['model', 'Color', 'HP', 'Weight (KG)', 'price'], dtype='object')

In [4]:
type(df.columns)

pandas.core.indexes.base.Index

In [5]:
df.columns.tolist()

['model', 'Color', 'HP', 'Weight (KG)', 'price']

In [6]:
df.columns.to_numpy()

array(['model', 'Color', 'HP', 'Weight (KG)', 'price'], dtype=object)

In [7]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [9]:
df["Color"]

0       Red
1     White
2     Black
3     White
4      Blue
5       Red
6    Silver
Name: Color, dtype: object

In [10]:
df.iloc[0]

model          Peykan
Color             Red
HP                 48
Weight (KG)       990
price              33
Name: 0, dtype: object

In [11]:
df2 = pd.DataFrame([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]])
df2

               0       1    2     3     4
0         Peykan     Red   48   990    33
1         BMW X6   White  335  2320  2400
2    Peugeot 206   Black  105  1025   105
3           Tiba   White   87  1027   120
4  Nissan Junior    Blue   93  1540   230
5  Nissan Junior     Red   93  1540   186
6      renault 5  Silver   48   850    38

In [12]:
df2 = pd.DataFrame([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]],
       index = ['a','b','c','d','e','f','g'],
       columns= ['model' , 'Color' , 'HP', 'Weight (KG)', 'price'])
df2

           model   Color   HP  Weight (KG)  price
a         Peykan     Red   48          990     33
b         BMW X6   White  335         2320   2400
c    Peugeot 206   Black  105         1025    105
d           Tiba   White   87         1027    120
e  Nissan Junior    Blue   93         1540    230
f  Nissan Junior     Red   93         1540    186
g      renault 5  Silver   48          850     38

In [13]:
df.head()

           model  Color   HP  Weight (KG)  price
0         Peykan    Red   48          990     33
1         BMW X6  White  335         2320   2400
2    Peugeot 206  Black  105         1025    105
3           Tiba  White   87         1027    120
4  Nissan Junior   Blue   93         1540    230

In [14]:
df.head(1)

    model Color  HP  Weight (KG)  price
0  Peykan   Red  48          990     33

In [17]:
df.head(5)

           model  Color   HP  Weight (KG)  price
0         Peykan    Red   48          990     33
1         BMW X6  White  335         2320   2400
2    Peugeot 206  Black  105         1025    105
3           Tiba  White   87         1027    120
4  Nissan Junior   Blue   93         1540    230

In [15]:
df.tail()

           model   Color   HP  Weight (KG)  price
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

In [18]:
df.tail(1)

       model   Color  HP  Weight (KG)  price
6  renault 5  Silver  48          850     38

In [19]:
df.tail(2)

          model   Color  HP  Weight (KG)  price
5  Peykan Vanet     Red  80          960     68
6     renault 5  Silver  48          850     38

In [20]:
df.sample(4, random_state= 42)

          model  Color   HP  Weight (KG)  price
0        Peykan    Red   48          990     33
1        BMW X6  White  335         2320   2400
5  Peykan Vanet    Red   80          960     68
2   Peugeot 206  Black  105         1025    105

In [21]:
df.sample(frac=0.4 , random_state= 42)

          model  Color   HP  Weight (KG)  price
0        Peykan    Red   48          990     33
1        BMW X6  White  335         2320   2400
5  Peykan Vanet    Red   80          960     68

In [22]:
df.sample(frac=0.4, ignore_index=True , random_state = 42)

          model  Color   HP  Weight (KG)  price
0        Peykan    Red   48          990     33
1        BMW X6  White  335         2320   2400
2  Peykan Vanet    Red   80          960     68

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   model        7 non-null      object
 1   Color        7 non-null      object
 2   HP           7 non-null      int64
 3   Weight (KG)  7 non-null      int64
 4   price        7 non-null      int64
dtypes: int64(3), object(2)
memory usage: 408.0+ bytes

In [26]:
df.describe()

               HP  Weight (KG)        price
count    7.000000     7.000000     7.000000
mean   113.714286  1244.571429   427.714286
std     99.966185   522.948008   872.248572
min     48.000000   850.000000    33.000000
25%     64.000000   975.000000    53.000000
50%     87.000000  1025.000000   105.000000
75%     99.000000  1283.500000   175.000000
max    335.000000  2320.000000  2400.000000

In [27]:
df['Color'].value_counts()

Color
Red       2
White     2
Black     1
Blue      1
Silver    1
Name: count, dtype: int64